//8 Вариант

#include <iostream>
#include <cmath> // Импортируем библиотеку cmath для нахождения квадратного корня
#include <iomanip> // Импортируем библиотеку iomanip для выставления количества знаков после запятой
#include <windows.h> // Импортируем библиотеку windows для работы с кодировкой консоли
using namespace std; // Не писать std::

int main() {
    SetConsoleOutputCP(65001); // Устанавливаем UTF-8 для вывода русских букв в консоли
    SetConsoleCP(65001); // Устанавливаем UTF-8 для ввода
    // Вычисляем sqrt(3 + sqrt(6 + ... sqrt(60 + sqrt(63)))) начиная с самого внутреннего корня
    double sum; // значение выражения
    int count; // число итераций цикла
    int i; // число под корнем (63, 60, ..., 3)

    sum = 0;
    count = 0;
    for (i = 63; i >= 3; i -= 3) { // цикл for
        count += 1;
        sum = sqrt(i + sum); // прибавляем число и берем корень
    }
    cout << setprecision(10) << fixed << "Цикл for: значение выражения = " << sum;
    cout << " " << "Количество итераций = " << count << endl;


    sum = 0;
    count = 0;
    i = 63;
    while (i >= 3) { // цикл с предусловием
        count += 1;
        sum = sqrt(i + sum); // прибавляем число и берем корень
        i -= 3; // следующее число меньше на 3
    }
    cout << "Цикл while: значение выражения = " << sum;
    cout << " " << "Количество итераций = " << count << endl;


    sum = 0;
    count = 0;
    i = 63;
    do { // цикл с постусловием
        count += 1;
        sum = sqrt(i + sum); // прибавляем число и берем корень
        i -= 3; // следующее число меньше на 3
    } while (i >= 3);
    cout << "Цикл do-while: значение выражения = " << sum;
    cout << " " << "Количество итераций = " << count << endl;

    return 0;
}